Revit 2015 API
DockablePaneProviderData Members
The DockablePaneProviderData type exposes the following members.
Constructors
Name | Description
DockablePaneProviderData
Initializes a new instance of the DockablePaneProviderData class
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
FrameworkElement
 The Windows Presentation Framework object containing the pane's user interface.
InitialState
 The initial position of the docking pane.
See Also
DockablePaneProviderData Class
Autodesk.Revit.UI Namespace